[
  {
    "conference": "PyTexas 2025",
    "location": "Pittsburgh, PA",
    "date": "2025-04-13",
    "talk_title": "A Community Managers Guide to Open Source/Open Source Guide to Community Management",
    "video_url": null,
    "description": "I had the privelige of Keynoting PyTexas, where I talked about the lessons learned as a developer who has contributed and maintained open source projects and built worldwide communities."
  },
  {
    "conference": "PyCon US 2024",
    "location": "Pittsburgh, PA",
    "date": "2024-05-20",
    "talk_title": "Black Python Devs x PyCon US",
    "video_url": "https://www.youtube.com/watch?v=jYZBpoYjxLo&list=PLfDBFPSIcChU_nuhdLibx6R-TrYJwZjid",
    "description": "PyCon US 2024, I gave the opening keynote where I introduced the world to Black Python Devs"
  },
  {
    "conference": "RenderATL 2024",
    "location": "Atlanta, GA",
    "date": "2024-06-12",
    "talk_title": "Awkward End-to-End Testing with Playwright",
    "video_url": "https://www.youtube.com/watch?v=dBJowtn1lQE",
    "description": "Testing your project is easy right? Maybe if you own all the components or if you have a testing team to make sure everything is acting the way it should.\n Sadly end-to-end testing is full of pitfalls and things to think about, especially when you don't control the entire stack. Often you end up with awkward conversations with engineering, marketing and others as you all fight for space to get your message across.\n\nEnter Playwright, the open-source testing platform, to help us test what we control and what we don't.\n\nThis talk will walk through testing your site End-to-End with playwright. We'll address the highlights, concerns and next steps when you need to test things that may or may not be in your control. It won't solve all your testing problems but it will help you identify when you need to have those awkward conversations early before they're with your users."
  },
  {
    "conference": "Refactr.Tech",
    "location": "Atlanta, GA",
    "date": "2023-10-08",
    "talk_title": "Python vs Hip Hop: How we can remix culture, community, and code",
    "conference_url": "https://refactr.tech/",
    "video_url": "https://www.youtube.com/watch?v=ee1DhKMJ_Kg",
    "description": "In 1994 - \"The south had something to say\" according to Andre 3000, and two of the greatest rap albums ever were released out of New York City. We also saw the evolution of major programming languages like PHP, CSS, and Python. The modern era of developer has lived in a world where Hip Hop culture went from being considered niche and dangerous to being the definition of popular culture. In that same time we've seen the Python Programming language become a standard bearer for non-traditional developers across many industries. But the development landscape has more in common and still much to learn from the music genre. This talk shares insights that developer communities in large can learn from the raise of modern hip hop culture."
  },
  {
    "conference": "FlaskCon",
    "location": "Online",
    "date": "2023-12-15",
    "talk_title": "End-to-End Flask App Testing with Playwright"
  }
]
